import type { LawNode } from '@/types/law';

/**
 * โครงสร้างสารบัญ พระราชบัญญัติประกอบรัฐธรรมนูญว่าด้วยคณะกรรมการสิทธิมนุษยชนแห่งชาติ พ.ศ. ๒๕๖๐
 */
export const nhrcTree: LawNode[] = [
  {
    "type": "ข้อความเบื้องต้น",
    "number": "",
    "title": "บททั่วไป",
    "articleIds": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7"
    ]
  },
  {
    "type": "หมวด",
    "number": "๑",
    "title": "คณะกรรมการสิทธิมนุษยชนแห่งชาติ",
    "articleIds": [
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30",
      "31",
      "32"
    ]
  },
  {
    "type": "หมวด",
    "number": "๒",
    "title": "การดำเนินการตามหน้าที่ของคณะกรรมการ",
    "articleIds": [
      "33",
      "34",
      "35",
      "36",
      "37",
      "38",
      "39",
      "40",
      "41",
      "42",
      "43",
      "44",
      "45",
      "46"
    ]
  },
  {
    "type": "หมวด",
    "number": "๓",
    "title": "สำนักงานคณะกรรมการสิทธิมนุษยชนแห่งชาติ",
    "articleIds": [
      "47",
      "48",
      "49",
      "50",
      "51",
      "52",
      "53",
      "54",
      "55",
      "56",
      "57",
      "58"
    ]
  },
  {
    "type": "หมวด",
    "number": "๔",
    "title": "บทกำหนดโทษ",
    "articleIds": [
      "59"
    ]
  },
  {
    "type": "หมวด",
    "number": "",
    "title": "บทเฉพาะกาล",
    "articleIds": [
      "60",
      "61",
      "62",
      "63",
      "64",
      "65",
      "66",
      "67"
    ]
  }
];
