import type { LawNode } from '@/types/law';

/**
 * โครงสร้างสารบัญ พระราชบัญญัติข้อมูลข่าวสารของราชการ พ.ศ. ๒๕๔๐
 */
export const officialInfoTree: LawNode[] = [
  {
    "type": "ข้อความเบื้องต้น",
    "number": "",
    "title": "บททั่วไป",
    "articleIds": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6"
    ]
  },
  {
    "type": "หมวด",
    "number": "๑",
    "title": "การเปิดเผยข้อมูลข่าวสาร",
    "articleIds": [
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13"
    ]
  },
  {
    "type": "หมวด",
    "number": "๒",
    "title": "ข้อมูลข่าวสารที่ไม่ต้องเปิดเผย",
    "articleIds": [
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20"
    ]
  },
  {
    "type": "หมวด",
    "number": "๓",
    "title": "ข้อมูลข่าวสารส่วนบุคคล",
    "articleIds": [
      "21",
      "22",
      "23",
      "24",
      "25"
    ]
  },
  {
    "type": "หมวด",
    "number": "๔",
    "title": "เอกสารประวัติศาสตร์",
    "articleIds": [
      "26"
    ]
  },
  {
    "type": "หมวด",
    "number": "๕",
    "title": "คณะกรรมการข้อมูลข่าวสารของราชการ",
    "articleIds": [
      "27",
      "28",
      "29",
      "30",
      "31",
      "32",
      "33",
      "34"
    ]
  },
  {
    "type": "หมวด",
    "number": "๖",
    "title": "คณะกรรมการวินิจฉัยการเปิดเผยข้อมูลข่าวสาร",
    "articleIds": [
      "35",
      "36",
      "37",
      "38",
      "39"
    ]
  },
  {
    "type": "หมวด",
    "number": "๗",
    "title": "บทกำหนดโทษ",
    "articleIds": [
      "40",
      "41"
    ]
  },
  {
    "type": "หมวด",
    "number": "",
    "title": "บทเฉพาะกาล",
    "articleIds": [
      "42",
      "43"
    ]
  }
];
