import type { Article } from '@/types/law';

/**
 * ข้อมูลตัวบท พระราชบัญญัติให้ใช้ประมวลกฎหมายอาญา พ.ศ. ๒๔๙๙ (มาตรา ๑ - ๘)
 */
export const penalActArticles: Record<string, Article> = {
  "1": {
    "id": "1",
    "paragraphs": [
      "พระราชบัญญัตินี้เรียกว่า “พระราชบัญญัติให้ใช้ประมวลกฎหมายอาญา พ.ศ. ๒๔๙๙”"
    ]
  },
  "2": {
    "id": "2",
    "paragraphs": [
      "พระราชบัญญัตินี้ให้ใช้บังคับตั้งแต่วันถัดจากวันประกาศในราชกิจจานุเบกษาเป็นต้นไป"
    ],
    "note": "ราชกิจจานุเบกษา เล่ม ๗๓/ตอนที่ ๙๕/ฉบับพิเศษ หน้า ๑/๑๕ พฤศจิกายน ๒๔๙๙"
  },
  "3": {
    "id": "3",
    "paragraphs": [
      "ประมวลกฎหมายอาญาท้ายพระราชบัญญัตินี้ให้ใช้บังคับตั้งแต่วันที่ ๑ มกราคม พ.ศ. ๒๕๐๐ เป็นต้นไป"
    ]
  },
  "4": {
    "id": "4",
    "paragraphs": [
      "เมื่อประมวลกฎหมายอาญาได้ใช้บังคับแล้วให้ยกเลิกกฎหมายลักษณะอาญา"
    ]
  },
  "5": {
    "id": "5",
    "paragraphs": [
      "เมื่อประมวลกฎหมายอาญาได้ใช้บังคับแล้ว ในกรณีที่กฎหมายใดได้กำหนดโทษโดยอ้างถึงโทษฐานลหุโทษในกฎหมายลักษณะอาญาไว้ ให้ถือว่ากฎหมายนั้นได้อ้างถึงโทษ ดังต่อไปนี้",
      "ถ้าอ้างถึงโทษชั้น ๑ หมายความว่า ปรับไม่เกินหนึ่งร้อยบาท",
      "ถ้าอ้างถึงโทษชั้น ๒ หมายความว่า ปรับไม่เกินห้าร้อยบาท",
      "ถ้าอ้างถึงโทษชั้น ๓ หมายความว่า จำคุกไม่เกินสิบวัน หรือปรับไม่เกินห้าร้อยบาท หรือทั้งจำทั้งปรับ",
      "ถ้าอ้างถึงโทษชั้น ๔ หมายความว่า  จำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งพันบาท หรือทั้งจำทั้งปรับ"
    ]
  },
  "6": {
    "id": "6",
    "paragraphs": [
      "เมื่อประมวลกฎหมายได้ใช้บังคับแล้วในการจำคุกแทนค่าปรับตามกฎหมายใด ไม่ว่ากฎหมายนั้นจะบัญญัติไว้ประการใด ให้นำประมวลกฎหมายอาญามาใช้บังคับ แต่สำหรับความผิดที่ได้กระทำก่อนวันที่ประมวลกฎหมายอาญาใช้บังคับ มิให้กักขังเกินกว่าหนึ่งปีสำหรับโทษปรับกระทงเดียว และสองปีสำหรับโทษปรับหลายกระทง"
    ]
  },
  "7": {
    "id": "7",
    "paragraphs": [
      "ในกรณีวิธีการเพื่อความปลอดภัยตามมาตรา ๔๖ แห่งประมวลกฎหมายอาญา ให้นำบทบัญญัติแห่งประมวลกฎหมายวิธีพิจารณาความอาญามาใช้บังคับเสมือนเป็นความผิดอาญา แต่ห้ามมิให้คุมขังชั้นสอบสวนเกินกว่าสี่สิบแปดชั่วโมงนับแต่เวลาที่ผู้ถูกจับมาถึงที่ทำการของพนักงานฝ่ายปกครองหรือตำรวจ แต่มิให้นับเวลาเดินทางตามปกติที่นำตัวผู้ถูกจับมาศาลรวมเข้าในกำหนดเวลาสี่สิบแปดชั่วโมงนั้นด้วย"
    ]
  },
  "8": {
    "id": "8",
    "paragraphs": [
      "เมื่อประมวลกฎหมายอาญาได้ใช้บังคับแล้ว บทบัญญัติแห่งกฎหมายใดอ้างถึงกฎหมายลักษณะอาญา หรืออ้างถึงบทบัญญัติแห่งกฎหมายลักษณะอาญา ให้ถือว่าบทบัญญัติแห่งกฎหมายนั้นอ้างถึงประมวลกฎหมายอาญา หรือบทบัญญัติแห่งประมวลกฎหมายอาญาในบทมาตราที่มีนัยเช่นเดียวกัน แล้วแต่กรณี",
      "ผู้รับสนองพระบรมราชโองการ",
      "จอมพล ป.  พิบูลสงคราม",
      "นายกรัฐมนตรี"
    ]
  }
};
